{
  "_class_name": "AutoencoderKLQwenImage",
  "_diffusers_version": "0.36.0.dev0",
  "_name_or_path": "./tmp_model/vae",
  "attn_scales": [],
  "base_dim": 96,
  "dim_mult": [
    1,
    2,
    4,
    4
  ],
  "dropout": 0.0,
  "latents_mean": [
    -0.7571,
    -0.7089,
    -0.9113,
    0.1075,
    -0.1745,
    0.9653,
    -0.1517,
    1.5508,
    0.4134,
    -0.0715,
    0.5517,
    -0.3632,
    -0.1922,
    -0.9497,
    0.2503,
    -0.2921
  ],
  "latents_std": [
    2.8184,
    1.4541,
    2.3275,
    2.6558,
    1.2196,
    1.7708,
    2.6052,
    2.0743,
    3.2687,
    2.1526,
    2.8652,
    1.5579,
    1.6382,
    1.1253,
    2.8251,
    1.916
  ],
  "num_res_blocks": 2,
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": [
      "transformer_blocks.0.img_mod.1",
      "transformer_blocks.0.attn.to_q",
      "transformer_blocks.0.attn.to_k",
      "transformer_blocks.0.attn.to_v",
      "transformer_blocks.0.attn.add_k_proj",
      "transformer_blocks.0.attn.add_v_proj",
      "transformer_blocks.0.attn.add_q_proj",
      "transformer_blocks.0.attn.to_out.0",
      "transformer_blocks.0.attn.to_add_out",
      "transformer_blocks.0.img_mlp.net.0.proj",
      "transformer_blocks.0.img_mlp.net.2",
      "transformer_blocks.0.txt_mod.1",
      "transformer_blocks.0.txt_mlp.net.0.proj",
      "transformer_blocks.0.txt_mlp.net.2",
      "transformer_blocks.59.img_mod.1",
      "transformer_blocks.59.attn.to_q",
      "transformer_blocks.59.attn.to_k",
      "transformer_blocks.59.attn.to_v",
      "transformer_blocks.59.attn.add_k_proj",
      "transformer_blocks.59.attn.add_v_proj",
      "transformer_blocks.59.attn.add_q_proj",
      "transformer_blocks.59.attn.to_out.0",
      "transformer_blocks.59.attn.to_add_out",
      "transformer_blocks.59.img_mlp.net.0.proj",
      "transformer_blocks.59.img_mlp.net.2",
      "transformer_blocks.59.txt_mod.1",
      "transformer_blocks.59.txt_mlp.net.0.proj",
      "transformer_blocks.59.txt_mlp.net.2",
      "norm_out.linear",
      "proj_out"
    ],
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "temperal_downsample": [
    false,
    true,
    true
  ],
  "z_dim": 16
}
